# Pandas Lesson

## Introduction

Pandas, short for "Python Data Analysis Library" or "Panel Data", is a library for data manipulation and analysis. It is built on top of `Numpy` and is designed to work with `Numpy` arrays. Pandas is a library that provides high-performance, easy-to-use data structures and data analysis tools. It is designed for quick and easy data manipulation, aggregation, and visualization.

Pandas is often used in conjunction with numerical computing tools like `Numpy` and `SciPy`, analytical libraries like `statsmodels` and `scikit-learn`, and data visualization libraries like `Matplotlib` and `Seaborn`. While pandas adopts many coding idioms from `Numpy`, the biggest difference is that pandas is designed for working with tabular or heterogeneous data. Numpy, by contrast, is best suited for working with homogeneous numerical array data.

Some of the key features of Pandas are:

- Fast and efficient DataFrame object with default and customized indexing.
- Tools for loading data into in-memory data objects from different file formats.
- Data alignment and integrated handling of missing data.
- Reshaping and pivoting of data sets.
- Label-based slicing, indexing and subsetting of large data sets.
- Group by data for aggregation and transformations.
- High performance merging and joining of data.
- Time series functionality.

You can install Pandas using `conda` or `pip`:

```bash
conda install pandas
```

```bash
pip install pandas
```

Then import it in your Python code:

In [57]:
import pandas as pd

where pd is a standard alias for pandas.

We usually import numpy in tandem with pandas:

In [58]:
import numpy as np

## Data Structures

Pandas has two main data structures:

- Series
- DataFrame

### Series

A series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

The simplest Series is formed from only an array of data:

In [59]:
obj = pd.Series([5, 6, -3, 2])

obj

0    5
1    6
2   -3
3    2
dtype: int64

The string representation of a Series displayed interactively shows the `index` on the left and the `values` on the right.

Since we did not specify an index for the data, a default one consisting of the integers 0 through N - 1 (where N is the length of the data) is created. You can get the array representation and index object of the Series via its `array` and `index` attributes, respectively:

In [60]:
obj.array

<PandasArray>
[5, 6, -3, 2]
Length: 4, dtype: int64

In [61]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Like Numpy array, `shape` attribute returns a tuple with the shape of the data:

In [62]:
obj.shape

(4,)

You can also create a Series with a label index identifying each data point:

In [63]:
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [64]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [65]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

You can use labels in the index when selecting single values or a set of values:

In [66]:
obj2["b"]

7

In [67]:
obj2["d"] = 6

In [68]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

Or a list of labels:

In [69]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

> Create a new series with the default index and the following data: `[2.5, 4.0, 5.5, 6.75]`.

In [70]:
new_obj = pd.Series([2.5, 4.0, 5.5, 6.75])
new_obj

0    2.50
1    4.00
2    5.50
3    6.75
dtype: float64

You can use Numpy functions or NumPy-like operations, such as filtering with a boolean array, scalar multiplication, or applying math functions:

In [71]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [72]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [73]:
np.exp(obj2) # e^x

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

You can also think about a Series as a fixed-length, ordered `dictionary`, where the keys are the index and the values are the data:

In [74]:
"b" in obj2

True

In [75]:
"e" in obj2

False

You can create a Series from a dictionary, or vice versa:

In [76]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [77]:
obj3 = pd.Series(sdata)

obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [78]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

The index in the resulting Series will respect the order of the keys in the dictionary. You can override this by passing an index with the dictionary keys in the order you want them to appear in the Series:

In [79]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [80]:
obj4 = pd.Series(sdata, index=states)

obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Since no value for "California" was found, it appears as NaN (not a number) which is considered in pandas to mark missing or NA values. Since "Utah" was not included in states, it is excluded from the resulting object.

"Missing", "NA" or "null" can be used interchangeably to refer to missing data. The `isna` and `notna` functions in pandas could be used to detect missing data:

In [81]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [82]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

or using the instance method for Series:

In [83]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

A useful Series feature for many applications is that it automatically aligns differently-indexed data in arithmetic operations:

In [84]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [85]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [86]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the Series object itself and its index have a `name` attribute, which will be useful later.

Here, the index represents the states and the values represent the population of each state. Let's give a name to each of them:

In [87]:
obj4.name = "population"
obj4.index.name = "state"

In [88]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

You can alter the index in-place by assignment:

In [89]:
obj

0    5
1    6
2   -3
3    2
dtype: int64

In [90]:
obj.index = ["Steve", "Bob", "Jeff", "Ryan"]

In [91]:
obj

Steve    5
Bob      6
Jeff    -3
Ryan     2
dtype: int64

### DataFrame

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series (all sharing the same index).

![dataframe](../assets/dataframe.png)

One of the most common ways to create a DataFrame is from a dict of equal-length lists or NumPy arrays:

In [92]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)

In [93]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [94]:
# inspect the shape

frame.shape

(6, 3)

In [95]:
# select the first 5 rows

frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [96]:
# select the last 5 rows

frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

If you specify a sequence of columns, the DataFrame’s columns will be arranged in that order:

In [97]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

If you pass a column that isn’t contained in the dictionary, it will appear with missing values:

In [98]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

Both the `index` and `columns` are `Index` objects.

In [99]:
frame2.index
frame2.index.name = "idx"
frame2

     year   state  pop debt
idx
0    2000    Ohio  1.5  NaN
1    2001    Ohio  1.7  NaN
2    2002    Ohio  3.6  NaN
3    2001  Nevada  2.4  NaN
4    2002  Nevada  2.9  NaN
5    2003  Nevada  3.2  NaN

In [100]:
frame2.columns
frame2.columns.name = "Idk"
frame2.columns.name

'Idk'

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by dot attribute notation:

In [101]:
frame2["state"]

idx
0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [102]:
frame2.year

idx
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

Columns can be modified by assignment. For example, the empty 'debt' column could be assigned a scalar value or an array of values:

In [103]:
frame2["debt"] = 10.5
print(frame2)
frame3 = frame2.rename(columns={"debt":"debt_in_mil"})
frame3

Idk  year   state  pop  debt
idx
0    2000    Ohio  1.5  10.5
1    2001    Ohio  1.7  10.5
2    2002    Ohio  3.6  10.5
3    2001  Nevada  2.4  10.5
4    2002  Nevada  2.9  10.5
5    2003  Nevada  3.2  10.5

Idk  year   state  pop  debt_in_mil
idx
0    2000    Ohio  1.5         10.5
1    2001    Ohio  1.7         10.5
2    2002    Ohio  3.6         10.5
3    2001  Nevada  2.4         10.5
4    2002  Nevada  2.9         10.5
5    2003  Nevada  3.2         10.5

In [104]:
#frame2["debt"] = np.arange(6.)
frame2 = frame2.assign(debt=np.arange(len(frame2), dtype=float)) # Not modified In place (Could be both good and bad)
frame2

Idk  year   state  pop  debt
idx
0    2000    Ohio  1.5   0.0
1    2001    Ohio  1.7   1.0
2    2002    Ohio  3.6   2.0
3    2001  Nevada  2.4   3.0
4    2002  Nevada  2.9   4.0
5    2003  Nevada  3.2   5.0

When assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, it will be instead conformed exactly to the DataFrame’s index, inserting missing values in any holes:

In [105]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"]) #Nth happens
val = pd.Series([-1.2, -1.5, -1.7], index=[2, 4, 5]) #Changes

frame2["debt"] = val

frame2

Idk  year   state  pop  debt
idx
0    2000    Ohio  1.5   NaN
1    2001    Ohio  1.7   NaN
2    2002    Ohio  3.6  -1.2
3    2001  Nevada  2.4   NaN
4    2002  Nevada  2.9  -1.5
5    2003  Nevada  3.2  -1.7

Assigning a column that doesn’t exist will create a new column, for instance, let's create a boolean column that indicates whether the state is eastern:

In [106]:
frame2["eastern"] = frame2.state == "Ohio"

frame2

Idk  year   state  pop  debt  eastern
idx
0    2000    Ohio  1.5   NaN     True
1    2001    Ohio  1.7   NaN     True
2    2002    Ohio  3.6  -1.2     True
3    2001  Nevada  2.4   NaN    False
4    2002  Nevada  2.9  -1.5    False
5    2003  Nevada  3.2  -1.7    False

You can remove columns by using the `del` method.

In [107]:
del frame2["eastern"]

> Assign a range from 10 to 60 to the `debt` column.

In [108]:
len_frame2 = len(frame2)
base = 10.0
end = 60.0
frame2["debt"] = np.linspace(base, end, len_frame2)
frame2

Idk  year   state  pop  debt
idx
0    2000    Ohio  1.5  10.0
1    2001    Ohio  1.7  20.0
2    2002    Ohio  3.6  30.0
3    2001  Nevada  2.4  40.0
4    2002  Nevada  2.9  50.0
5    2003  Nevada  3.2  60.0

You can also create a DataFrame from a nested dict of dicts. Pandas will interpret the outer dict keys as the columns and the inner keys as the row indices:

In [295]:
frame3 = pd.DataFrame({"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}})
frame3

   A  B
a  1  3
b  2  4

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

Let's transpose the DataFrame (similar to a NumPy array transpose):

In [110]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

We can also set the `name` attributes for `index` and `columns`. Unlike Series, DataFrame does not have a `name` attribute.

In [111]:
frame3.index.name = "year"
frame3.columns.name = "state"

frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

> Create a new column `California` with any values you want.

In [112]:
california_data = {"California": {2000: 0.9, 2001: 1.5, 2002: 1.9, 2003:3.0}}
frame_to_merge = pd.DataFrame(california_data)
combined_frame = pd.concat([frame3, frame_to_merge], axis=1)
combined_frame

      Ohio  Nevada  California
2000   1.5     NaN         0.9
2001   1.7     2.4         1.5
2002   3.6     2.9         1.9
2003   NaN     NaN         3.0

You can return the data contained in a DataFrame as a 2D Numpy `ndarray`:

In [113]:
combined_frame.to_numpy()

array([[1.5, nan, 0.9],
       [1.7, 2.4, 1.5],
       [3.6, 2.9, 1.9],
       [nan, nan, 3. ]])

## Data types (dtypes)

For the most part, pandas uses Numpy arrays and dtypes for Series or individual columns of a DataFrame. NumPy provides support for `float`, `int`, `bool`, `timedelta64[ns]` and `datetime64[ns]` (note that Numpy does not support timezone-aware datetimes).

Pandas also extends Numpy type system, refer to the [documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#basics-dtypes) for more details.

Pandas has two ways to store strings.
- `object` dtype, which can hold any Python object, including strings.
- `StringDtype`, which is dedicated to strings.

Finally, arbitrary objects may be stored using the object dtype, but should be avoided to the extent possible (for performance and interoperability with other libraries and methods).

In [278]:
dft = pd.DataFrame(
    {
        "A": np.random.rand(3), 
        "B": 1, 
        "C": pd.Series(["foo"], dtype="string"), #original -> "foo", 
        "D": pd.Timestamp("20010102"), 
        "E": pd.Series([1.0] * 3).astype("float32"), 
        "F": False, 
        "G": pd.Series([1] * 3, dtype="int8")})

dft
# you can use dft["C"] = dft["C"].astype("string") instead

          A  B     C          D    E      F  G
0  0.126557  1   foo 2001-01-02  1.0  False  1
1  0.769364  1  <NA> 2001-01-02  1.0  False  1
2  0.076158  1  <NA> 2001-01-02  1.0  False  1

In [115]:
dft.dtypes

A           float64
B             int64
C            string
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

On a `Series` object, use the `dtype` attribute:

In [116]:
dft["A"].dtype

dtype('float64')

If a pandas object contains data with multiple dtypes in a single column, the dtype of the column will be chosen to accommodate all of the data types (`object` is the most general).

In [117]:
# these ints are coerced to floats
pd.Series([1, 2, 3, 4, 5, 6.0])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [118]:
# string data forces an `object` dtype
pd.Series([1, 2, 3, 6.0, "foo"])

0      1
1      2
2      3
3    6.0
4    foo
dtype: object

You can use the `astype()` method to explicitly convert dtypes from one to another.

In [119]:
dft["G"].astype("float64")

0    1.0
1    1.0
2    1.0
Name: G, dtype: float64

`select_dtypes` method allows you to select columns based on their dtype:

In [120]:
dft.select_dtypes(include=['number'])

          A  B    E  G
0  0.447383  1  1.0  1
1  0.722605  1  1.0  1
2  0.486180  1  1.0  1

In [121]:
dft.select_dtypes(include=['number', 'bool'])

          A  B    E      F  G
0  0.447383  1  1.0  False  1
1  0.722605  1  1.0  False  1
2  0.486180  1  1.0  False  1

In [122]:
dft.select_dtypes(include=['number', 'bool'], exclude=['int8'])

          A  B    E      F
0  0.447383  1  1.0  False
1  0.722605  1  1.0  False
2  0.486180  1  1.0  False

> Select all numeric columns except float.

In [123]:
dft.select_dtypes(include=['number'], exclude=["float"])

   B  G
0  1  1
1  1  1
2  1  1

## Index Objects

Pandas' `Index` objects are responsible for holding the axis labels (a Series' index, a DataFrame's index or a DataFrame's column names) and other metadata (like the axis name or names).

Any array or other sequence of labels used when constructing a Series or DataFrame is internally converted to an Index:

In [124]:
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [125]:
# slice the index

index[1:]
index

Index(['a', 'b', 'c'], dtype='object')

Index objects are immutable and hence can't be modified by the user *INPLACE*:

In [126]:
index[1] = "d"
# You can still replace everything by using obj.index = [1, 2, 3]

TypeError: Index does not support mutable operations

You can share Index objects between data structures:

In [ ]:
labels = pd.Index(np.arange(3))

labels

Int64Index([0, 1, 2], dtype='int64')

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [ ]:
# check if they are the same

obj2.index is labels

True

An Index also behaves like a set:

In [127]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [129]:
"Ohio" in frame3.columns

True

In [130]:
2003 in frame3.columns

False

Unlike a set, an Index can contain duplicate labels. Selections with duplicate labels will select all occurrences of that label.

You can refer to the [Index](https://pandas.pydata.org/pandas-docs/stable/reference/indexing.html) documentation for more information.

> Return unique values of the following index using a suitable method: `pd.Index(['a', 'b', 'c', 'a'])`.

In [134]:
index_example = pd.Index(['a', 'b', 'c', 'a'])
unique_index = index_example.drop_duplicates()
# you can also use pd.Index(index_example.unique())
unique_index

Index(['a', 'b', 'c'], dtype='object')

## Reindexing

`reindex` is the fundamental data alignment method in pandas. It is used to create a new object with the data conformed to a new index.

In [135]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

`reindex` can be used to rearrange the data according to the new index, introducing missing values if any index values were not already present:

In [138]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
# You can still put dupe into reindex.

obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

You can reindex the (row) index or columns of a dataframe:

In [143]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                        index=['a', 'c', 'd'],
                        columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [144]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [147]:
# reindex the columns

states = ["Texas", "Utah", "California"]

frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [148]:
# another way to reindex the columns

frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

The `method` option allows us to do interpolation or filling of values when reindexing. For example, we can fill the missing values with the last known value (forward fill):

In [149]:
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

obj3

0      blue
2    purple
4    yellow
dtype: object

In [150]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

This is useful for filling in missing values when reindexing ordered data like time series.

## Dropping Entries

You can drop entries from an axis using the `drop` method. It will return a new object with the indicated value or values deleted from an axis:

In [152]:
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])

obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [153]:
new_obj = obj.drop("c")

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [154]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

With DataFrame, index values can be deleted from either axis:

In [155]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                        index=["Ohio", "Colorado", "Utah", "New York"],
                        columns=["one", "two", "three", "four"])

In [156]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The default `drop` method is to drop rows (`axis="index"` or `axis=0`).

In [160]:
data.drop(["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

You can drop columns by specifying `axis="columns"` or `axis=1`:

In [159]:
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

> Drop columns `two` and `four`.

In [161]:
data.drop(["two","four"], axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

## Indexing, Selection and Filtering

Series indexing (`obj[...]`) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers. Here are some examples of this:

In [166]:
obj = pd.Series(np.arange(0,10.,2), index=["a", "b", "c", "d", "e"])

obj

a    0.0
b    2.0
c    4.0
d    6.0
e    8.0
dtype: float64

In [167]:
obj["b"]

2.0

In [168]:
obj[2]

4.0

In [169]:
obj[2:4]

c    4.0
d    6.0
dtype: float64

In [170]:
obj[["b", "a", "d"]]

b    2.0
a    0.0
d    6.0
dtype: float64

In [171]:
obj[[1, 4, 3]]

b    2.0
e    8.0
d    6.0
dtype: float64

In [172]:
obj[obj < 2]

a    0.0
dtype: float64

Although the indexing method above works, the **preferred way** to select index values is with the special `loc` operator:

In [173]:
obj.loc[["b", "d"]]

b    2.0
d    6.0
dtype: float64

The reason to prefer `loc` is because of the different treatment of integers when indexing with `[]`.

`loc` indexing refers to the index label and not the position. On the other hand, indexing with `[]` refers to the position.

`loc` -> Labels -- `iloc` -> Index

In [199]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])

obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

In [176]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [177]:
obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

`obj2.loc[[0, 1, 2]]` will fail because 0, 1, 2 are not in the index *label*.

In [178]:
obj1.loc[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [180]:
obj2.loc[[0, 1, 2]]

KeyError: "None of [Int64Index([0, 1, 2], dtype='int64')] are in the [index]"

You can also slice with labels using `loc`.

In [181]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [194]:
# assign values using `loc`

obj2.loc["b":"c"] = 5

obj2

a    5
b    5
c    5
dtype: int64

On the other hand, `iloc` indexing refers to the position and not the index label.

In [195]:
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [196]:
# negative indexing works too

obj1.iloc[[-1, -3]]

1    3
2    1
dtype: int64

> Return the values of `1, 2, 3` from `obj2` using `iloc`.

In [200]:
obj2.iloc[0:3]

a    1
b    2
c    3
dtype: int64

Default indexing on DataFrame retrieves one or more columns:

In [201]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                        index=["Ohio", "Colorado", "Utah", "New York"],
                        columns=["one", "two", "three", "four"])

In [202]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [203]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [204]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

However, slicing with `[]` slices the rows:

`Wdym However?` - Comment

In [206]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

Selecting/filtering data with a Boolean array:

In [217]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Indexing with a boolean DataFrame:

In [215]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

We can use this to assign the value 0 to each location with the value `True`:

In [218]:
data[data < 5] = 0

data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

Like Series, DataFrame has special attributes `loc` and `iloc` for label-based and integer-based indexing, respectively.

In [219]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [220]:
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

You can combine both row and column selection in loc by separating the selections with a comma:

In [221]:
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int64

To select columns:

In [222]:
data.loc[:, "one"]

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int64

You can also use Boolean arrays with `loc`, but not `iloc`.

In [223]:
data.loc[data.three >=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

`iloc` works similarly:

In [224]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [225]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [226]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [227]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

## Arithmetic and Data Alignment

Similar to Series, for arithmetic computations, data alignment introduces missing values in the label locations that don't overlap.

In [228]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), index=["Ohio", "Texas", "Colorado"])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])

In [229]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [230]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [237]:
df1 + df2

#df1.add(df2, fill_value=0) You can add like this too.

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other. 

Here is an example where we set a particular value to NA (null) by assigning `np.nan` to it:

In [283]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))

df2.loc[1, "b"] = np.nan

In [294]:
df1

       a    b     c     d
min  0.0  1.0   2.0   3.0
max  8.0  9.0  10.0  11.0

In [240]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Using the add method on df1, pass df2 and an argument to `fill_value`, which substitutes the passed value for any missing values in the operation:

In [241]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

Refer to the [Flexible Binary Operations](https://pandas.pydata.org/pandas-docs/stable/user_guide/basics.html#matching-broadcasting-behavior) documentation for more information.

> Multiply `df1` and `df2` with a `fill_value` of 1.

In [242]:
df1.mul(df2, fill_value=1)

      a     b      c      d     e
0   0.0   1.0    4.0    9.0   4.0
1  20.0   5.0   42.0   56.0   9.0
2  80.0  99.0  120.0  143.0  14.0
3  15.0  16.0   17.0   18.0  19.0

### Combining overlapping data sets

 A problem occasionally arising is the combination of two similar data sets where _values in one are preferred over the other_.
 
 An example would be two data series representing a particular economic indicator where one is considered to be of *“higher quality”*. However, the lower quality series might extend further back in history or have more complete data coverage. As such, we would like to combine two DataFrame objects where missing values in one DataFrame are conditionally filled with like-labeled values from the other DataFrame.

In [243]:
df1 = pd.DataFrame(
    {"A": [1.0, np.nan, 3.0, 5.0, np.nan], "B": [np.nan, 2.0, 3.0, np.nan, 6.0]}
)

df2 = pd.DataFrame(
    {
        "A": [5.0, 2.0, 4.0, np.nan, 3.0, 7.0],
        "B": [np.nan, np.nan, 3.0, 4.0, 6.0, 8.0],
    }
)

In [244]:
df1

     A    B
0  1.0  NaN
1  NaN  2.0
2  3.0  3.0
3  5.0  NaN
4  NaN  6.0

In [245]:
df2

     A    B
0  5.0  NaN
1  2.0  NaN
2  4.0  3.0
3  NaN  4.0
4  3.0  6.0
5  7.0  8.0

If we prefer df1 over df2, we can combine the two DataFrames using `combine_first`:

In [246]:
df1.combine_first(df2)

     A    B
0  1.0  NaN
1  2.0  2.0
2  3.0  3.0
3  5.0  4.0
4  3.0  6.0
5  7.0  8.0

## Function Application and Mapping

NumPy ufuncs (element-wise array methods) work fine with pandas objects:

In [ ]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])
#use generator.

In [248]:
frame

               b         d         e
Utah    0.613225  1.398107 -2.038930
Ohio    0.110620  1.417313  0.657760
Texas   1.605801 -0.523805 -0.494030
Oregon  0.583989  0.248443  0.132891

In [249]:
np.abs(frame)

               b         d         e
Utah    0.613225  1.398107  2.038930
Ohio    0.110620  1.417313  0.657760
Texas   1.605801  0.523805  0.494030
Oregon  0.583989  0.248443  0.132891

You can apply a function on one-dimensional arrays to each column or row of a DataFrame using the `apply` method:

In [250]:
def f1(x):
    return x.max() - x.min()

frame.apply(f1)

b    1.495181
d    1.941118
e    2.696691
dtype: float64

Here the function `f1`, which computes the difference between the maximum and minimum of a Series, is invoked once on each column in frame (default behavior). The result is a Series having the columns of frame as its index.

If you check the documentation of `apply`, the default value for `axis` is `"index"` or `0`, which means the function is applied on each column.

If you pass `axis="columns"` or `axis=1` to `apply`, the function will be invoked once per row instead. A helpful way to think about this is as "apply across the columns":

In [251]:
frame.apply(f1, axis="columns")

Utah      3.437037
Ohio      1.306694
Texas     2.129606
Oregon    0.451098
dtype: float64

Many of the most common array statistics (like sum and mean) are DataFrame methods, so using apply is not necessary. We will discuss more about this in the next lesson.

Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating-point value in `frame`. You can do this with `applymap`:

In [253]:
def my_format(x):
    return f"{x:.2f}"

In [254]:
frame.applymap(my_format)

           b      d      e
Utah    0.61   1.40  -2.04
Ohio    0.11   1.42   0.66
Texas   1.61  -0.52  -0.49
Oregon  0.58   0.25   0.13

> Define a function `f2` similar to f1 but return `min` and `max` as a `Series`, with the index `["min", "max"]`.
>
> Apply `f2` to `frame` (using the default `apply` behavior) and see the result.

In [256]:
def f2(frame):
    return pd.Series([frame.min(), frame.max()], index=["min", "max"])

frame.apply(f2)

            b         d        e
min  0.110620 -0.523805 -2.03893
max  1.605801  1.417313  0.65776

## Sorting and Ranking

Sorting the data by some criterion is another important built-in operation. To sort lexicographically by row or column index, use the `sort_index` method, which returns a new, sorted object:

In [257]:
obj = pd.Series(np.arange(4), index=['d', 'a', 'b', 'c'])

obj

d    0
a    1
b    2
c    3
dtype: int64

In [258]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

With a DataFrame, you can sort by index on either axis:

In [259]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)), index=["three", "one"], columns=["d", "a", "b", "c"])

In [260]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

Again, the default behavior is to sort by row `index`. You can sort by column by passing `axis=1` or `axis="columns"`:

In [261]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [262]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

Sorting is in ascending order by default, but can be reversed by passing `ascending=False`.

In [263]:
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort by values, use `sort_values`:

In [264]:
obj = pd.Series([4, 7, -3, 2])

obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

Any missing values are sorted to the end of the Series by default:

In [265]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

Missing values can be sorted to the start instead by using the `na_position` option:

In [266]:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

When sorting a DataFrame, you can use the data in one or more columns as the sort keys. To do so, pass one or more column names to `sort_values`:

In [267]:
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})

frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [268]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

You can also sort by multiple columns:

In [269]:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

Ranking assigns ranks from one through the number of valid data points in an array, starting from the lowest value.

The `rank` methods for Series and DataFrame are the place to look; by default, `rank` breaks ties by assigning each group the mean rank:

In [271]:
obj = pd.Series([7, -5, 7, 4, 2, 4, 0, 4])

obj.rank()

# Note that the reason why there is 3 "5" rank is because "(3 + 4 + 5) / 3"
# Same for 7.5 -> (7 place + 8 place) / 2

0    7.5
1    1.0
2    7.5
3    5.0
4    3.0
5    5.0
6    2.0
7    5.0
dtype: float64

Ranks can also be assigned according to the order in which they’re observed in the data:

In [272]:
obj.rank(method="first")

0    7.0
1    1.0
2    8.0
3    4.0
4    3.0
5    5.0
6    2.0
7    6.0
dtype: float64

In [273]:
# ranking in descending order

obj.rank(ascending=False)

0    1.5
1    8.0
2    1.5
3    4.0
4    6.0
5    4.0
6    7.0
7    4.0
dtype: float64

DataFrame can compute ranks over the rows or the columns:

In [274]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1], "c": [-2, 5, 8, -2.5]})

frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [275]:
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

> Rank `frame` over the columns.

*Do you mean across the row?* - Comment

In [277]:
frame.rank(axis = 1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0